import type { Story } from '../types/game'

export const stories: Story[] = [
  {
    id: '1',
    title: '按时吃药',
    difficulty: 'hard',
    surface: '妻子总是让我按时吃药，虽然我很爱她，但是我还是偷偷吐掉了药。',
    bottom:
      '妻子因车祸过世，而我因为过度思念她，患上了精神分裂，总是看到妻子的幻觉。即使在幻觉中，妻子也劝我好好吃药，但我还是把药吐掉了。这样，我才能继续看见她。',
  },
  {
    id: '2',
    title: '找吃的',
    difficulty: 'easy',
    surface: '我在找吃的，突然啪的一声，我死掉了。',
    bottom: '我是一只蚊子。',
  },
  {
    id: '3',
    title: '姐姐妹妹靠近我',
    difficulty: 'easy',
    surface: '我的姐姐妹妹靠近了我，然后我们都死掉了。',
    bottom: '我们在玩消消乐。',
  },
  {
    id: '4',
    title: '男友消失后',
    difficulty: 'easy',
    surface: '男友消失后，我家周围就经常出现命案。',
    bottom: '我是毛利兰。',
  },
  {
    id: '5',
    title: '我杀了他',
    difficulty: 'easy',
    surface: '我杀了他，我却哭了。',
    bottom: '我在切洋葱。',
  },
  {
    id: '6',
    title: '哥哥怀孕了',
    difficulty: 'medium',
    surface: '哥哥怀孕了，怀的是妈妈。',
    bottom:
      '哥哥吃饭吃多了，肚子鼓得像怀孕了一样。我说“哥哥你怀孕了”，哥哥回我一句“我怀你妈”。',
  },
  {
    id: '7',
    title: '吃掉所有人',
    difficulty: 'easy',
    surface: '我吃了爸爸，爸爸吃了妈妈，弟弟吃了所有人。',
    bottom: '我们在玩跳棋。',
  },
  {
    id: '8',
    title: '源源不断的肉',
    difficulty: 'easy',
    surface: '妈妈没有出去买肉，可是家里却有源源不断的肉吃。',
    bottom: '爸爸买了肉。',
  },
  {
    id: '9',
    title: '笔仙之后',
    difficulty: 'easy',
    surface: '今天我们在玩笔仙，第二天全校的人都消失了。',
    bottom: '第二天放假了。',
  },
  {
    id: '10',
    title: '河边散步',
    difficulty: 'hard',
    surface: '有个男子跟他女友去河边散步，突然他的女友掉进河里了。那个男子急忙跳到水里去找，可没找到他的女友，他伤心地离开了这里。过了几年后，他故地重游，这时看到有个老人家在钓鱼。可那老人家钓上来的鱼身上没有水草，他就问那老人家：“为什么鱼身上没有沾到一点水草？”那老人家说：“你不知道啊，这河从没有长过水草。”说到这时，那男子突然跳到水里，自杀了。为什么？',
    bottom:
      '当年他跳下水救女友时，腿被东西缠住了。他以为是水草，就拼命蹬开，最终自己上了岸。直到老人说河里根本没有水草，他才猛然意识到：当年缠住他的，是女友的头发。因为自己的误判，他亲手错过了救女友的机会，巨大的愧疚和绝望让他崩溃自杀。',
  },
  {
    id: '11',
    title: '冰淇淋',
    difficulty: 'hard',
    surface:
      '哥哥事后非常后悔。如果那天他答应妈妈去仓库吃冰淇淋，弟弟也许就不会死了。',
    bottom:
      '妈妈新买了一箱冰淇淋，放在仓库的冰柜里，但忘了关柜门。弟弟去仓库玩耍，因为想拿冰淇淋，失去平衡栽进了冰柜里，冰柜门也随之关上。哥哥放学回家时，妈妈提议去仓库吃冰淇淋，但哥哥拒绝了。直到晚饭时大家才发现弟弟不见了，最终在冰柜里找到了已经死去的弟弟。',
  },
  {
    id: '12',
    title: '深夜敲门',
    difficulty: 'hard',
    surface: '一个女人半夜听到敲门声，开门后看到门外没人，她却立刻报警了。为什么？',
    bottom:
      '她住在海边悬崖上的独栋房子里，门外没有可以藏人的地方。既然有人敲门，但开门后外面却一个人都没有，那就说明敲门的人很可能已经失足掉下了悬崖，所以她立刻报警。',
  },
  {
    id: '13',
    title: '末班车站台',
    difficulty: 'medium',
    surface: '一个男人每天都赶末班车，某天他提前半小时到站，却反而再也没有回家。',
    bottom:
      '男人一直依赖末班车到站后广播提醒自己避开一条危险的小路。那天他提前到站，错过了广播，走上了那条路并遭遇不测。',
  },
  {
    id: '14',
    title: '林间提灯',
    difficulty: 'medium',
    surface: '深夜森林里，一盏灯笼突然熄灭。第二天，村里所有人都知道真相了。',
    bottom:
      '灯笼是守林人用来向村庄报平安的信号。灯笼熄灭意味着他发现了失踪者，因此全村人都知道孩子已经被找到了。',
  },
  {
    id: '15',
    title: '金钥匙',
    difficulty: 'hard',
    surface: '女人把一把金钥匙丢进湖里，转身笑了。几个小时后，整栋宅子都陷入混乱。',
    bottom:
      '金钥匙是她故意伪装成重要线索的假钥匙，真正的保险柜钥匙早已被她藏好。其他人看到她丢钥匙后，全都去湖里寻找，导致宅子无人看守。',
  },
]

export const getStoryById = (storyId: string) =>
  stories.find((story) => story.id === storyId)
